export default {
  code: 
`
// 在这个一生中最难忘的日子
// 我给您表演个写代码
// 我要开始写啦
const { 奥奥, 芮芮 } = 🌎;
奥奥.say('嫁给我吧!❤️');
芮芮.response('Yes, I do！');
Utils.marry(奥奥,芮芮);
Utils.generateInvitation(奥奥,芮芮);
// 好了我写完了
// 我要开始运行啦`,
  executions: [{
    name:'初始化',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'解压中',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'组装中',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'打包中',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'微笑🙂',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'大笑😄',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'编译中...',
    time: '',
    visible: false
  }],
  barrages: [
    '66666666',
    '愿你美梦成真',
    '你的邀请函真是美',
    '人美心更美',
    '你是最棒的',
    '哇哇哇',
    '好羡慕！！好羡慕！！！',
    '好期待！好期待！',
    '牛逼！！！',
    '稳了，老哥！',
    '😗 😙 😚 😋 ',
    '绝配绝配！',
    '百年好合！',
    '早生贵子',
    '白头到老',
    '有夫妻相'  
  ],
}